<template>
  <div>
    <div>{{"今天是"+date }}{{ isholiday ? "今天是节假日":"今天不是节假日" }}</div>
    <div @click="ZhanSanOrder">张三需付款：{{ ZhanTotalPrice }}元</div>
    <div @click="LiSiOrder">李四需付款：{{ LiTotalPrice }}元</div>
  </div>
</template>
<script>
var holiday=[
  {
    "date": "2024-01-01",
    "周": "星期一",
    "is": "0",
    "说明": "元旦0"
  },
  {
    "date": "2024-01-02",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-03",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-04",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-05",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-06",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-01-07",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-01-08",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-09",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-10",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-11",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-12",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-13",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-01-14",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-01-15",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-16",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-17",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-18",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-19",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-20",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-01-21",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-01-22",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-23",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-24",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-25",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-26",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-27",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-01-28",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-01-29",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-30",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-01-31",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-01",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-02",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-03",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-02-04",
    "周": "星期日",
    "is": "1",
    "说明": "调休"
  },
  {
    "date": "2024-02-05",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-06",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-07",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-08",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-09",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-10",
    "周": "星期六",
    "is": "0",
    "说明": "春节"
  },
  {
    "date": "2024-02-11",
    "周": "星期日",
    "is": "0",
    "说明": "春节"
  },
  {
    "date": "2024-02-12",
    "周": "星期一",
    "is": "0",
    "说明": "春节0"
  },
  {
    "date": "2024-02-13",
    "周": "星期二",
    "is": "0",
    "说明": "春节0"
  },
  {
    "date": "2024-02-14",
    "周": "星期三",
    "is": "0",
    "说明": "春节0"
  },
  {
    "date": "2024-02-15",
    "周": "星期四0",
    "is": "0",
    "说明": "春节"
  },
  {
    "date": "2024-02-16",
    "周": "星期五0",
    "is": "0",
    "说明": "春节"
  },
  {
    "date": "2024-02-17",
    "周": "星期六",
    "is": "0",
    "说明": "春节"
  },
  {
    "date": "2024-02-18",
    "周": "星期日",
    "is": "1",
    "说明": "调休"
  },
  {
    "date": "2024-02-19",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-20",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-21",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-22",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-23",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-24",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-02-25",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-02-26",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-27",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-28",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-02-29",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-01",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-02",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-03-03",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-03-04",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-05",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-06",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-07",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-08",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-09",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-03-10",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-03-11",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-12",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-13",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-14",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-15",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-16",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-03-17",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-03-18",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-19",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-20",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-21",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-22",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-23",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-03-24",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-03-25",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-26",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-27",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-28",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-29",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-03-30",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-03-31",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-04-01",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-02",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-03",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-04",
    "周": "星期四",
    "is": "0",
    "说明": "清明节0"
  },
  {
    "date": "2024-04-05",
    "周": "星期五",
    "is": "0",
    "说明": "清明节"
  },
  {
    "date": "2024-04-06",
    "周": "星期六",
    "is": "0",
    "说明": "清明节"
  },
  {
    "date": "2024-04-07",
    "周": "星期日",
    "is": "1",
    "说明": "调休"
  },
  {
    "date": "2024-04-08",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-09",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-10",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-11",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-12",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-13",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-04-14",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-04-15",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-16",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-17",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-18",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-19",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-20",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-04-21",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-04-22",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-23",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-24",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-25",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-26",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-27",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-04-28",
    "周": "星期日",
    "is": "1",
    "说明": "调休"
  },
  {
    "date": "2024-04-29",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-04-30",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-01",
    "周": "星期三",
    "is": "0",
    "说明": "五一0"
  },
  {
    "date": "2024-05-02",
    "周": "星期四",
    "is": "0",
    "说明": "五一"
  },
  {
    "date": "2024-05-03",
    "周": "星期五",
    "is": "0",
    "说明": "五一"
  },
  {
    "date": "2024-05-04",
    "周": "星期六",
    "is": "0",
    "说明": "五一"
  },
  {
    "date": "2024-05-05",
    "周": "星期日",
    "is": "0",
    "说明": "五一"
  },
  {
    "date": "2024-05-06",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-07",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-08",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-09",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-10",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-11",
    "周": "星期六",
    "is": "1",
    "说明": "调休"
  },
  {
    "date": "2024-05-12",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-05-13",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-14",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-15",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-16",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-17",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-18",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-05-19",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-05-20",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-21",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-22",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-23",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-24",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-25",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-05-26",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-05-27",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-28",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-29",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-30",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-05-31",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-01",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-06-02",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-06-03",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-04",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-05",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-06",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-07",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-08",
    "周": "星期六",
    "is": "0",
    "说明": "端午节"
  },
  {
    "date": "2024-06-09",
    "周": "星期日",
    "is": "0",
    "说明": "端午节"
  },
  {
    "date": "2024-06-10",
    "周": "星期一",
    "is": "0",
    "说明": "端午节0"
  },
  {
    "date": "2024-06-11",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-12",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-13",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-14",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-15",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-06-16",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-06-17",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-18",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-19",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-20",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-21",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-22",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-06-23",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-06-24",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-25",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-26",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-27",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-28",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-06-29",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-06-30",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-07-01",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-02",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-03",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-04",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-05",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-06",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-07-07",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-07-08",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-09",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-10",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-11",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-12",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-13",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-07-14",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-07-15",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-16",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-17",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-18",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-19",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-20",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-07-21",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-07-22",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-23",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-24",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-25",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-26",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-27",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-07-28",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-07-29",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-30",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-07-31",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-01",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-02",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-03",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-08-04",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-08-05",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-06",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-07",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-08",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-09",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-10",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-08-11",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-08-12",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-13",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-14",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-15",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-16",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-17",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-08-18",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-08-19",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-20",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-21",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-22",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-23",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-24",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-08-25",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-08-26",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-27",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-28",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-29",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-30",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-08-31",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-09-01",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-09-02",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-03",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-04",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-05",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-06",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-07",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-09-08",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-09-09",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-10",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-11",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-12",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-13",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-14",
    "周": "星期六",
    "is": "1",
    "说明": "调休"
  },
  {
    "date": "2024-09-15",
    "周": "星期日",
    "is": "0",
    "说明": "中秋"
  },
  {
    "date": "2024-09-16",
    "周": "星期一",
    "is": "0",
    "说明": "中秋"
  },
  {
    "date": "2024-09-17",
    "周": "星期二",
    "is": "0",
    "说明": "中秋0"
  },
  {
    "date": "2024-09-18",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-19",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-20",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-21",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-09-22",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-09-23",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-24",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-25",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-26",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-27",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-09-28",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-09-29",
    "周": "星期日",
    "is": "1",
    "说明": "调休"
  },
  {
    "date": "2024-09-30",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-01",
    "周": "星期二",
    "is": "0",
    "说明": "国庆0"
  },
  {
    "date": "2024-10-02",
    "周": "星期三",
    "is": "0",
    "说明": "国庆0"
  },
  {
    "date": "2024-10-03",
    "周": "星期四",
    "is": "0",
    "说明": "国庆0"
  },
  {
    "date": "2024-10-04",
    "周": "星期五",
    "is": "0",
    "说明": "国庆"
  },
  {
    "date": "2024-10-05",
    "周": "星期六",
    "is": "0",
    "说明": "国庆"
  },
  {
    "date": "2024-10-06",
    "周": "星期日",
    "is": "0",
    "说明": "国庆"
  },
  {
    "date": "2024-10-07",
    "周": "星期一",
    "is": "0",
    "说明": "国庆"
  },
  {
    "date": "2024-10-08",
    "周": "星期二",
    "is": "1",
    "说明": "调休"
  },
  {
    "date": "2024-10-09",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-10",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-11",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-12",
    "周": "星期六",
    "is": "1",
    "说明": "调休"
  },
  {
    "date": "2024-10-13",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-10-14",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-15",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-16",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-17",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-18",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-19",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-10-20",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-10-21",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-22",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-23",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-24",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-25",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-26",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-10-27",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-10-28",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-29",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-30",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-10-31",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-01",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-02",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-11-03",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-11-04",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-05",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-06",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-07",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-08",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-09",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-11-10",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-11-11",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-12",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-13",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-14",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-15",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-16",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-11-17",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-11-18",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-19",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-20",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-21",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-22",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-23",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-11-24",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-11-25",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-26",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-27",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-28",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-29",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-11-30",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-01",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-02",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-03",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-04",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-05",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-06",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-07",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-08",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-09",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-10",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-11",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-12",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-13",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-14",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-15",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-16",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-17",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-18",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-19",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-20",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-21",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-22",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-23",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-24",
    "周": "星期二",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-25",
    "周": "星期三",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-26",
    "周": "星期四",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-27",
    "周": "星期五",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-28",
    "周": "星期六",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-29",
    "周": "星期日",
    "is": "0",
    "说明": ""
  },
  {
    "date": "2024-12-30",
    "周": "星期一",
    "is": "1",
    "说明": ""
  },
  {
    "date": "2024-12-31",
    "周": "星期二",
    "is": "1",
    "说明": ""
  }
];

function isHoliday(date){
  for (let i = 0; i < holiday; i++) {
    if (holiday[i]["date"]==date){
      return true;
    }
  }
  return false;

}
  function formatDate(date, fmt) {
  if (typeof date == 'string') {
    return date;
  }

  if (!fmt) fmt = "yyyy-MM-dd hh:mm:ss";

  if (!date || date == null) return null;
  var o = {
    'M+': date.getMonth() + 1, // 月份
    'd+': date.getDate(), // 日
    'h+': date.getHours(), // 小时
    'm+': date.getMinutes(), // 分
    's+': date.getSeconds(), // 秒
    'S': date.getMilliseconds() // 毫秒
  }
  if (/(y+)/.test(fmt)) fmt = fmt.replace(RegExp.$1, (date.getFullYear() + '').substr(4 - RegExp.$1.length))
  for (var k in o) {
    if (new RegExp('(' + k + ')').test(fmt)) fmt = fmt.replace(RegExp.$1, (RegExp.$1.length === 1) ? (o[k]) : (('00' + o[k]).substr(('' + o[k]).length)))
  }
  return fmt
}

export default {
      name: 'test',
      beforeMount() {
        console.log(isHoliday("2024-01-05"))
        // 获取当前日期
        const currentDate = new Date()
        // 更改节假日
        var date = formatDate(currentDate,"yyyy-MM-dd");
        this.date = date;
        if (isHoliday(date)){
          this.isholiday = true
        }else {
          this.isholiday = false
        }
        //举行的活动是打折还是满减
        if(this.isholiday){
          var number = Math.floor(Math.random()*2 + 1);
          if (number == 1 ){
            this.policy = this.calDiscount;
          }else{
            this.policy = this.calFullReduction;
          }
        }else {
          this.policy = this.noActivity;
        }
      },
      data () {
            return {
              date: null,
              isholiday: null,
              policy : null,
              discount: 0.8,
              //满减结构 满20 - 5 ,满 10 - 2
              fullReduction:[{20:5},{10:2}],
              ZhanTotalPrice: 0,
                  LiTotalPrice: 0,
                  // 用于保存顾客点的商品,每点一个商品，往里面存储一个商品ID
                  shoppingCarList: [],
                  goodsPrice: {
                        BEFFNOODLE_BIG: 18,
                        BEFFNOODLE_MIDDLE: 16,
                        BEFFNOODLE_SMALL: 14,
                        FATINTESTINENOODLE_BIG: 20,
                        FATINTESTINENOODLE_MIDDLE: 18,
                        FATINTESTINENOODLE_SMALL: 16,
                        MILK_TEA: 12,
                        BEEF_PIE: 10,
                        PACKAGE_NO1: 38,
                        PACKAGE_NO2: 40
                  }
            }
      },

      mounted () {},

      methods: {
            noActivity(orderList){
              let totalPrice = 0;
              const _orderList = orderList || this.shoppingCarList
              _orderList.forEach(item => {
                if (item) {
                  totalPrice += this.goodsPrice[item]
                }
              })
              return totalPrice
            },
            calFullReduction(orderList){
              let totalPrice = 0
              const _orderList = orderList || this.shoppingCarList
              _orderList.forEach(item => {
                if (item) {
                  totalPrice += this.goodsPrice[item]
                }
              })
              this.fullReduction.forEach(item=>{
                if(totalPrice > Object.keys(item)[0]){
                  totalPrice -= item[Object.keys(item)[0]];
                }
              })
              return totalPrice;
            },
            calDiscount(orderList){
              let totalPrice = 0
              const _orderList = orderList || this.shoppingCarList
              _orderList.forEach(item => {
                if (item) {
                  totalPrice += this.goodsPrice[item]
                }
              })
              return totalPrice * this.discount
            },
            calculate (orderList,policy) {
                  let totalPrice = 0
                  const _orderList = orderList || this.shoppingCarList
                  _orderList.forEach(item => {
                        if (item) {
                              totalPrice += this.goodsPrice[item]
                        }
                  })
                  // 获取当前日期
                  const currentDate = new Date()
                  // 更改节假日
                  var date = formatDate(currentDate,"yyyy-MM-dd");
                  // 调用 isHoliday() 函数判断当前日期是否为节假日
                  // 节假日则进行满减或打折逻辑计算
                  if (this.isholiday) {
                   totalPrice = this.policy(orderList)
                  }
                  return totalPrice
            },
            ZhanSanOrder () {
                  const zhanOrderList = ['PACKAGE_NO1', 'BEEF_PIE']
                  this.ZhanTotalPrice = this.calculate(zhanOrderList)
            },
            LiSiOrder () {
                  const LiOrderList = ['FATINTESTINENOODLE_MIDDLE', 'MILK_TEA', 'MILK_TEA']
                  this.LiTotalPrice = this.calculate(LiOrderList)
            }
      }
}
</script>
<style lang="scss" scoped></style>
